---
kind: other
id: Methods.T:Autodesk.Revit.DB.DetailEllipse
source: html/bd9b58fc-35dd-ee2c-8a87-8fe54f31d4ba.htm
---
# DetailEllipse Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.